app/controllers/issues_controller.rb

SELECT "issues".* FROM "issues"
---
  def index
    @issues = Issue.all

INSERT INTO "issues" ("title", "address", "picture", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @issue = Issue.new(issue_params)

    respond_to do |format|
      if @issue.save

UPDATE "issues" SET "picture" = ?, "updated_at" = ? WHERE "issues"."id" = ?  [["picture", "geladeira-4.jpg"], ["updated_at", "2016-02-26 00:34:26.661822"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @issue.update(issue_params)

DELETE FROM "issues" WHERE "issues"."id" = ?  [["id", 1]]
---
  def destroy
    @issue.destroy